{"class_name": "Model", "keras_version": "2.1.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 128], "name": "input_3", "sparse": false}, "inbound_nodes": [], "name": "input_3"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_10", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1024, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "dense_10"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "epsilon": 1e-05, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9, "center": true}, "inbound_nodes": [[["dense_10", 0, 0, {}]]], "name": "batch_normalization_10"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "activation_10"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_11", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "dense_11"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11", "epsilon": 1e-05, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9, "center": true}, "inbound_nodes": [[["dense_11", 0, 0, {}]]], "name": "batch_normalization_11"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "name": "activation_11"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_12"}, "inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "dropout_12"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_12", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_12", 0, 0, {}]]], "name": "dense_12"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_12", "epsilon": 1e-05, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9, "center": true}, "inbound_nodes": [[["dense_12", 0, 0, {}]]], "name": "batch_normalization_12"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "name": "activation_12"}, {"class_name": "Dropout", "config": {"rate": 0.125, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_13"}, "inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "dropout_13"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_13", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1024, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_13", 0, 0, {}]]], "name": "dense_13"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_13", "epsilon": 1e-05, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9, "center": true}, "inbound_nodes": [[["dense_13", 0, 0, {}]]], "name": "batch_normalization_13"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_13"}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "name": "activation_13"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_14"}, "inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "dropout_14"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_14", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_14", 0, 0, {}]]], "name": "dense_14"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_14"}, "inbound_nodes": [[["dense_14", 0, 0, {}]]], "name": "activation_14"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_15"}, "inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "dropout_15"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_15", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1024, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_15", 0, 0, {}]]], "name": "dense_15"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_15"}, "inbound_nodes": [[["dense_15", 0, 0, {}]]], "name": "activation_15"}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_16"}, "inbound_nodes": [[["activation_15", 0, 0, {}]]], "name": "dropout_16"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_16", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 23, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_16", 0, 0, {}]]], "name": "dense_16"}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_16"}, "inbound_nodes": [[["dense_16", 0, 0, {}]]], "name": "activation_16"}], "input_layers": [["input_3", 0, 0]], "output_layers": [["activation_16", 0, 0]], "name": "model_3"}, "backend": "tensorflow"}